:PROPERTIES:
:ID:       62380240-2804-497b-b806-8a849dbdecd0
:END:
#+title: Rust types

- one of their most fundamental roles of types is to hint how to interpret bits of memory
*** COMMENT examples
#+begin_src jupyter-rust :session assoc1 :exports both
trait AssociatedType { type Assoc; type Aff; }
struct Struct;
#[derive(Debug)]
struct OtherStruct;
impl AssociatedType for Struct { type Assoc = OtherStruct; type Aff = String; }
impl OtherStruct {
    fn new() -> OtherStruct { OtherStruct }
}
println!("{:?}\n{:?}",
         <Struct as AssociatedType>::Assoc::new(),
         <Struct as AssociatedType>::Aff::new());
#+end_src

#+RESULTS:
: OtherStruct
: ""

